In [25]:
import numpy as np
import pandas as pd
import pandas_profiling as pp

In [26]:
path = "~/Dev/black-friday/data/data.csv"
data = pd.read_csv(path)
data.head(10)

/home/william/Dev/black-friday/venv/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3145: DtypeWarning: Columns (0,4,7,8,9,10,11) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6,14,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
5,1000003,P00193542,M,26-35,15,A,3,0,1,2,NaN,15227
6,1000004,P00184942,M,46-50,7,B,2,1,1,8,17,19215
7,1000004,P00346142,M,46-50,7,B,2,1,1,15,NaN,15854
8,1000004,P0097242,M,46-50,7,B,2,1,1,16,NaN,15686
9,1000005,P00274942,M,26-35,20,A,1,1,8,NaN,NaN,7871

In [27]:
# pp.ProfileReport(data, title="Data Profile Report")

In [28]:
data.tail(10)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
537571,1001317,P00046742,M,46-50,7,B,3,1,1,2,15,15799
537572,1001317,P00016842,M,46-50,7,B,3,1,1,2,15,8235
537573,1001317,P00220342,M,46-50,7,B,3,1,5,NaN,NaN,6967
537574,1001317,P00352142,M,46-50,7,B,3,1,1,6,16,15470
537575,1001317,P00274942,M,46-50,7,B,3,1,8,NaN,NaN,3984
537576,1001317,P00090842,M,46-50,7,B,3,1,11,15,NaN,4584
537577,1001317,P00115542,M,46-50,7,B,3,1,8,NaN,NaN,5848
537578,1001317,P00217942,M,46-50,7,B,3,1,5,NaN,NaN,5198
537579,1001317,P00335942,M,46-50,7,B,3,1,8,NaN,NaN,8015
537580,1001317,P00035542,M,46-50,7,B,3,1,3,4,12,1

In [29]:
data.tail(10)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
537571,1001317,P00046742,M,46-50,7,B,3,1,1,2,15,15799
537572,1001317,P00016842,M,46-50,7,B,3,1,1,2,15,8235
537573,1001317,P00220342,M,46-50,7,B,3,1,5,NaN,NaN,6967
537574,1001317,P00352142,M,46-50,7,B,3,1,1,6,16,15470
537575,1001317,P00274942,M,46-50,7,B,3,1,8,NaN,NaN,3984
537576,1001317,P00090842,M,46-50,7,B,3,1,11,15,NaN,4584
537577,1001317,P00115542,M,46-50,7,B,3,1,8,NaN,NaN,5848
537578,1001317,P00217942,M,46-50,7,B,3,1,5,NaN,NaN,5198
537579,1001317,P00335942,M,46-50,7,B,3,1,8,NaN,NaN,8015
537580,1001317,P00035542,M,46-50,7,B,3,1,3,4,12,1

In [ ]:
data.shape

In [ ]:
data.nunique()

In [ ]:
data_["Male"] = data_["Gender"] == "M"
del data_["Gender"]
data__ = data_.replace({'A' : '1', 'B' : '2' , 'C' : '3'})
data__.head()

In [ ]:
data__ = data__.dropna()
data__.head()

(537581, 12)

In [31]:
data.nunique()

User_ID                       11499
Product_ID                     3591
Gender                            3
Age                               8
Occupation                       43
City_Category                     4
Stay_In_Current_City_Years        6
Marital_Status                    5
Product_Category_1               37
Product_Category_2               35
Product_Category_3               31
Purchase                      30269
dtype: int64

In [32]:
data_["Male"] = data_["Gender"] == "M"
del data_["Gender"]
data__ = data_.replace({'A' : '1', 'B' : '2' , 'C' : '3'})
data__.head()

,User_ID,Product_ID,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Male
0,1000001,P00069042,0-17,10,1,2,0,3,NaN,NaN,8370,False
1,1000001,P00248942,0-17,10,1,2,0,1,6,14,15200,False
2,1000001,P00087842,0-17,10,1,2,0,12,NaN,NaN,1422,False
3,1000001,P00085442,0-17,10,1,2,0,12,14,NaN,1057,False
4,1000002,P00285442,55+,16,3,4+,0,8,NaN,NaN,7969,False

In [34]:
data__ = data__.dropna()
data__.head()

,User_ID,Product_ID,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Male
1,1000001,P00248942,0-17,10,1,2,0,1,6,14,15200,False
6,1000004,P00184942,46-50,7,2,2,1,1,8,17,19215,False
13,1000005,P00145042,26-35,20,1,1,1,1,2,5,15665,False
14,1000006,P00231342,51-55,9,1,1,0,5,8,14,5378,False
16,1000006,P0096642,51-55,9,1,1,0,2,3,4,13055,False